Reports/РегистрНалоговогоУчета_СводныйРегистрДоходовОтРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>РегистрНалоговогоУчета_СводныйРегистрДоходовОтРеализации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСпискаОрганизаций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСпискаПодразделений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширеннаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтрицательноеКрасным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОтчета</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/РегистрНалоговогоУчета_СводныйРегистрДоходовОтРеализации/Ext/ObjectModule.bsl
Перем мСписокИсточниковФинансирования Экспорт;
Перем мСписокСтруктурныхЕдиниц Экспорт;
Перем мСписокПодразделений Экспорт;
Перем мДеревоСтруктурныхЕдиниц Экспорт;
Перем СохраненнаяНастройка Экспорт;
Перем Расшифровки Экспорт;
Перем ПромежуточныеДанные Экспорт;
Перем РежимРасшифровки Экспорт;
Перем ВедётсяУчетПоПодразделениям Экспорт;

#Если Клиент Тогда

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	СтандартныеОтчеты.ЗаполнитьДанныеОтчета(ЭтотОбъект);
	
КонецПроцедуры

Процедура СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина, ВнешниеНаборыДанных = Неопределено) Экспорт
	
	Результат.Очистить();
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ВыводЗаголовкаОтчета(ЭтотОбъект, Результат);
	ДоработатьКомпоновщикПередВыводом(ВнешниеНаборыДанных);
	//КомпоновщикНастроек.Восстановить();
	//НастройкаКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	СтандартныеОтчеты.ВывестиОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, ВнешниеНаборыДанных);
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	// Выполним дополнительную обработку Результата отчета
	ОбработкаРезультатаОтчета(Результат);
	
	ВыводПодписиОтчета(ЭтотОбъект,Результат);
	
	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(Результат, ПолучитьТекстЗаголовка(), Строка(глТекущийПользователь));
	
	Возврат;
	
КонецПроцедуры

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ДоработатьКомпоновщикПередВыводом(ВнешниеНаборыДанных) Экспорт
	
	СписокСчетДоходовОтРеализации = Новый Массив;
	СписокСчетДоходовОтРеализации.Добавить(Планысчетов.Типовой.ДоходОтРеализацииПродукцииИОказанияУслуг);
	
	СписокПрочихСчетовДоходов = Новый Массив;
	СписокПрочихСчетовДоходов.Добавить(Планысчетов.Типовой.ДоходыОтФинансирования);
	СписокПрочихСчетовДоходов.Добавить(Планысчетов.Типовой.ПрочиеДоходы_);
	
	СписокИсключаемыхСчетов = Новый Массив;
		
	СписокСчетовКурсовыхРазниц = Новый Массив;
	СписокСчетовКурсовыхРазниц.Добавить(Планысчетов.Типовой.ДоходыОтКурсовойРазницы);
	
	СписокСчетовКурсовыхРазницРасх = Новый Массив;
	СписокСчетовКурсовыхРазницРасх.Добавить(Планысчетов.Типовой.РасходыПоКурсовойРазнице);
	
	мСписокСчетовКурсовыхРазниц = Планысчетов.Типовой.ДоходыОтКурсовойРазницы;
	
	мВИдыСубконто1 = Новый Массив;
	мВИдыСубконто1.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.ТипыОпераций);
	
	мВИдыСубконто2 = Новый Массив;
	мВИдыСубконто2.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Доходы);
	
	Если ЗначениеЗаполнено(НачалоПериода) Тогда
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(НачалоПериода));
	Иначе
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", Дата(1, 1, 1));
	КонецЕсли;
	Если ЗначениеЗаполнено(КонецПериода) Тогда
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецДня(КонецПериода));
	Иначе
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", Дата(3999, 11, 1));
	КонецЕсли;
	
	Если мДеревоСтруктурныхЕдиниц.Колонки.Количество() = 0 Тогда 
		
		СписокСтруктурныхЕдиниц = Новый СписокЗначений;
		СписокСтруктурныхЕдиниц.ЗагрузитьЗначения(мСписокСтруктурныхЕдиниц.ВыгрузитьЗначения());
		
		Для Каждого СтрПодразделение Из мСписокПодразделений Цикл 
			СписокСтруктурныхЕдиниц.Добавить(СтрПодразделение.Значение);
		КонецЦикла;		
				
		мДеревоСтруктурныхЕдиниц = СтандартныеОтчеты.СформироватьДеревоСЕ(, СписокСтруктурныхЕдиниц);
		
	КонецЕсли;
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "СчетДоходовОтРеализации", СписокСчетДоходовОтРеализации);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "СчетПрочихДоходов", СписокПрочихСчетовДоходов);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "СписокИсключаемыхСчетов", СписокИсключаемыхСчетов);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "СписокСчетовКурсовыхРазниц", СписокСчетовКурсовыхРазниц);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "СписокСчетовКурсовыхРазницРасх", СписокСчетовКурсовыхРазницРасх);
	//ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "СписокСчетовКурсовыхРазницДохСоб", СписокСчетовКурсовыхРазницДохСоб);
	//ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "СписокСчетовКурсовыхРазницРасхГос", СписокСчетовКурсовыхРазницРасхГос);
	//ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "СписокСчетовКурсовыхРазницРасхСоб", СписокСчетовКурсовыхРазницРасхСоб);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "мВИдыСубконто1", мВИдыСубконто1);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "мВИдыСубконто2", мВИдыСубконто2);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "мСписокСчетовКурсовыхРазниц", мСписокСчетовКурсовыхРазниц);
	
	ТиповыеОтчеты.ДобавитьОтборПоОрганизациямИПодразделениям(КомпоновщикНастроек, мДеревоСтруктурныхЕдиниц);
	
КонецПроцедуры

Процедура ИнициализацияОтчета() Экспорт
	
	СтандартныеОтчеты.ИнициализацияОтчета(ЭтотОбъект);
	
КонецПроцедуры

Процедура ВыводПодписиОтчета(ОтчетОбъект,Результат)
	
	Макет = ПолучитьОбщийМакет("ЗаголовокРегистраНалоговогоУчета");
	ОбластьПодписи        = Макет.ПолучитьОбласть("Подвал");
	
	Если ОтчетОбъект <> Неопределено Тогда
		Организации                       = ОтчетОбъект.мСписокСтруктурныхЕдиниц;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организации) Тогда
		НомСтр = 0;
		Для Каждого Организация Из Организации Цикл 
			НомСтр= НомСтр + 1;
			Руководители = ОбщегоНазначения.ОтветственныеЛицаОрганизаций(Организация.Значение,КонецПериода);
		КонецЦикла;                                   		
		
		Если НомСтр >=14 Тогда
			Руководители = ОбщегоНазначения.ОтветственныеЛицаОрганизаций(Организации[0].Значение,КонецПериода);
		КонецЕсли;
		
	КонецЕсли;
	
	Руководитель = Руководители.Руководитель;
	Бухгалтер    = Руководители.ГлавныйБухгалтер;
	
	ОбластьПодписи.Параметры.ФИОРуководителя	= Руководитель;
	ОбластьПодписи.Параметры.ФИОглБухгалтера 	= Бухгалтер;
	
	Результат.Вывести(ОбластьПодписи);
	
КонецПроцедуры

Процедура ВыводЗаголовкаОтчета(ОтчетОбъект, Результат)
	
	Если ОтчетОбъект <> Неопределено Тогда
		Организации                       = ОтчетОбъект.мСписокСтруктурныхЕдиниц;
	КонецЕсли;
	
	ТекстОрганизации = "";
	
	Если ЗначениеЗаполнено(Организации) Тогда
		НомСтр = 0;
		Для Каждого Организация Из Организации Цикл 
			НомСтр= НомСтр + 1;
			СведенияОбОрганизации = ОбщегоНазначения.СведенияОЮрФизЛице(Организация.Значение);
		КонецЦикла;                                   		
		
		Если НомСтр >=14 Тогда
			СведенияОбОрганизации = ОбщегоНазначения.СведенияОЮрФизЛице(Организации[0].Значение);
		КонецЕсли;
		
	КонецЕсли;
	
	// Отбор
	ТекстОтбор = Строка(ОтчетОбъект.КомпоновщикНастроек.Настройки.Отбор);
	
	МакетЗаголовок = ПолучитьОбщийМакет("ЗаголовокРегистраНалоговогоУчета");
	ОбластьЗаголовок = МакетЗаголовок.ПолучитьОбласть("Заголовок");
	
	ОбластьЗаголовок.Параметры.ЗаголовокОтчета = "Сводный регистр доходов от реализации товаров (выполнения работ, оказания услуг) ";
	
	ОбластьЗаголовок.Параметры.ПолноеНаименование	= СведенияОбОрганизации.Представление;
	//ОбластьЗаголовок.Параметры.РНН 					= СведенияОбОрганизации.РНН;
	ОбластьЗаголовок.Параметры.БИН_ИИН				= СведенияОбОрганизации.БИН_ИИН;
	ОбластьЗаголовок.Параметры.Налоговыйпериод 		= СтандартныеОтчеты.ПолучитьПредставлениеПериода(ЭтотОбъект);
	ОбластьЗаголовок.Параметры.ОписаниеНастроекОтчета 		= ТекстОтбор;
	
	Результат.Вывести(ОбластьЗаголовок);
	
КонецПроцедуры

Функция ПолучитьТекстЗаголовка(ОрганизацияВНачале = Истина) Экспорт 
		
		
КонецФункции

Процедура ОбработкаРезультатаОтчета(Результат)
	
	ТиповыеОтчеты.ОбработкаРезультатаОтчета(ЭтотОбъект, Результат);

КонецПроцедуры

// Для настройки отчета (расшифровка и др.)
Процедура Настроить(Отбор, КомпоновщикНастроекОсновногоОтчета = Неопределено) Экспорт
	
	//ТиповыеОтчеты.НастроитьТиповойОтчет(ЭтотОбъект, Отбор, КомпоновщикНастроекОсновногоОтчета);
	ЗаполнитьНачальныеНастройки();
	
КонецПроцедуры

Процедура СохранитьНастройку() Экспорт
	
	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	
	СтруктураНастроек.Вставить("мСписокПодразделений", мСписокПодразделений);
	СтруктураНастроек.Вставить("мСписокСтруктурныхЕдиниц", мСписокСтруктурныхЕдиниц);
	СтруктураНастроек.Вставить("мДеревоСтруктурныхЕдиниц", мДеревоСтруктурныхЕдиниц);
	
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);

КонецПроцедуры

// Процедура заполняет параметры отчета по элементу справочника из переменной СохраненнаяНастройка.
Процедура ПрименитьНастройку() Экспорт
	
	Если СохраненнаяНастройка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	 
	СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
	ТиповыеОтчеты.ПрименитьСтруктуруПараметровОтчета(ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры


Расшифровки = Новый СписокЗначений;

НастройкаПериода = Новый НастройкаПериода;

#КонецЕсли
мСписокИсточниковФинансирования = Новый СписокЗначений;
мСписокСтруктурныхЕдиниц = Новый СписокЗначений;
мСписокПодразделений = Новый СписокЗначений;
мДеревоСтруктурныхЕдиниц = Новый ДеревоЗначений;

ВедётсяУчетПоПодразделениям = ОбщегоНазначения.ПолучитьПризнакОтображенияСтруктурныхПодразделений();

РежимРасшифровки = Ложь;
